app/Controllers/Admin/Blog.php

INSERT INTO `blog` (`judul`, `isi`, `created_at`, `updated_at`) VALUES ('12312asdf', '<p>asdfasdfasdfasdf<b>asdfsadfasdfasf</b></p>', '2022-09-16 10:16:01', '2022-09-16 10:16:01')
---
    public function simpan()
    {
        $this->BlogModel->save([
            'judul' => $this->request->getVar('judul'),
            'isi' => $this->request->getVar('isi'),
        ]);