app/Models/BlogModel.php

    public function getBlog($id = false)
    {
        if($id == false){
            $builder = $this->db->table('blog');
            $builder->select('blog.id, sampul, judul,kategori, deskripsi, isi, dilihat ,user_id, user.nama_user as nama_user, user.avatar, created_at');
            $builder->join('user', 'user.id = blog.user_id');
            $hasil =  $builder->get();
            return $hasil->getResult();
        }
        $builder = $this->db->table('blog');
        $builder->select('blog.id, sampul, judul, kategori, deskripsi, isi, dilihat, user_id, user.nama_user as nama_user, user.avatar, created_at');
        $builder->join('user', 'user.id = blog.user_id');
        $builder->where('blog.id', $id);
        $hasil = $builder->get();
---
SELECT `blog`.`id`, `sampul`, `judul`, `kategori`, `deskripsi`, `isi`, `dilihat`, `user_id`, `user`.`nama_user` as `nama_user`, `user`.`avatar`, `created_at`
FROM `blog`
JOIN `user` ON `user`.`id` = `blog`.`user_id`
SELECT `blog`.`id`, `sampul`, `judul`, `kategori`, `deskripsi`, `isi`, `dilihat`, `user_id`, `user`.`nama_user` as `nama_user`, `user`.`avatar`, `created_at`
FROM `blog`
JOIN `user` ON `user`.`id` = `blog`.`user_id`
WHERE `blog`.`id` = '27'